/*******************************************************************************
 * COPYRIGHT@SIGBEAN
 *******************************************************************************
 * 文件名称:  adc.c
 * 功能描述: （简要描述本文件的功能、内容及主要模块）    
 * 使用说明: （描述使用文件功能时的制约条件）
 * 文件作者:                
 * 编写日期: 
 * 修改历史: 
 *  
 * 修改日期修改人  BugID/CRID      修改内容
 * -----------------------------------------------------------------------------
 * 
 ******************************************************************************/
/******************************* 包含文件声明 *********************************/
#include <stdio.h>

#include <cortex_m4.h>
#include <core_cm3.h>
#include <adc.h>
#include <vos.h>
/******************************* 局部宏定义 ***********************************/

/******************************* 局部常数和类型定义 ***************************/

/******************************* 局部函数原型声明 *****************************/

/******************************* 函数实现 *************************************/
/*******************************************************************************
* 函数名称:  Dd_Adc_Enable
* 函数功能:  使能adc 0-5通道传输
* 相关文档: 
* 函数参数:
* 参数名称:  
* 返回值:
* 函数说明:
* 修改日期版本号修改人修改内容
* -----------------------------------------------------------------
* 
*******************************************************************************/
void Dd_Adc_Enable(unsigned int channel_num)
{
    /*温度传感器使能*/
    REG(TEMSEN_ENA) = 1;
    /*ADC使能*/
    REG(ADC_ENA) = 1;       
//    REG(ADC_CLK_DIV) = 4;    

    /*ADC通道选择，0~5*/
    REG(ADC_CHN) = channel_num;
    REG(ADC_RSTN) = 1;

    /*ADC开始*/
    REG(ADC_SOC) = 1;  
}
/*******************************************************************************
* 函数名称:  Dd_Adc_IntInit
* 函数功能:  使能adc定时中断
* 相关文档: 
* 函数参数:
* 参数名称:  
* 返回值:
* 函数说明:
* 修改日期版本号修改人修改内容
* -----------------------------------------------------------------
* 
*******************************************************************************/
void Dd_Adc_IntInit(void)
{
    NVIC_EnableIRQ(IRQ_ADC);    
    NVIC_SetPriority(IRQ_ADC,20);

    /* clear interrupt */
    REG(ADC_CTRL_INTCLR) |= 1;
    /*enable interrupt*/
    REG(ADC_CTRL_INTENA) |= 1;
    REG(ADC_CTRL_INTUNM) |= 1;
}
/*******************************************************************************
* 函数名称:  Dd_Adc_Isr
* 函数功能:  中断服务程序
* 相关文档: 
* 函数参数:
* 参数名称:  
* 返回值:
* 函数说明:
* 修改日期版本号修改人修改内容
* -----------------------------------------------------------------
* 
*******************************************************************************/
NB_FAST_CODE void Dd_Adc_Isr(void)
{
    u32 val;
    u32 regval;
    val = REG(ADC_CTRL_INTFLG);
    if(val == 1)
    {
        REG(ADC_CTRL_INTCLR) |= 1;
        regval = REG(ADC_RSLT);
        //REG(ADC_ENA) = 0;
        DD_DEBUG_PRINTF("ADC VALUE:%d\n",regval);
    }
    else
    {
        DD_DEBUG_PRINTF("ADC_CTRL_INTFLG:%d\n",val);

    }
}    
/*******************************************************************************/
void Dd_Adc_Test(void)
{
    u32 regval;
    int Count ;
    int voltage;
    DD_DEBUG_PRINTF("adc test\r\n");

    for(Count = 0;Count<5;Count++)
    {
        Dd_Adc_Enable(1);
        osal_Sleep(1000);
        regval = REG(ADC_RSLT);
        voltage = (regval * 840)/4096;
        DD_DEBUG_PRINTF("ADC VALUE:%d\n",regval);
        printf("voltage:%d\r\n",voltage);
    }    
    REG(ADC_RSTN) = 0;
    REG(ADC_ENA) = 0;       
}

/******************************* 源文件结束 ***********************************/

