/*******************************************************************************
********************************************************************************
* 文件名称: rf_test.h
* 功能描述: 
* 其它说明: 
* ------------------------------------------------------------------------------
* 
*******************************************************************************/

/******************************** 头文件保护开头 ******************************/
#ifndef RF_TEST_H
#define RF_TEST_H

/******************************** 包含文件声明 ********************************/
#include <type_def.h>

/******************************** 宏和常量定义 ********************************/
#define     RX_IQ_SWAP          1

#define     RF_TX_PHI           0
#define     RF_RX_PHI           2


#define     RF_CTRL	            0x400E0000
#define     RF_TX_RX	        0x400E0004
#define     RF_SPI_DATA	        0x400E0008
#define     RF_SPI_RDATA	    0x400E000C
#define     RF_SPI_BUSY	        0x400E0010
#define     RF_TX_INIT	        0x400E0014
/******************************** 类型定义 ************************************/

/******************************** 全局变量声明 ********************************/

/******************************** 外部函数原形声明 ****************************/
extern void Dd_Rf_IcWriteReg(u8 reg_id,u16 data);
extern u16 Dd_Rf_IcReadReg(u8 reg_id);
extern void Rf_ReadRegAll(void);
extern void Dd_Rf_Close(void);
extern void Dd_Mipi_LowPowerMode(void);
extern void Dd_LNAAndLpen_Low(void);

/******************************** 头文件保护结尾 ******************************/
#endif /*RF_TEST_H*/
/******************************** 头文件结束 **********************************/


